diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресВХ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ПревышениеОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВКМ_Год = ОбщегоНазначенияКлиентСервер.СтрокаВДату(Параметры.Год);   
	ПрочитатьДанныеИзВременногоХранилищаНаСервере(Параметры.АдресВХ)
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныеИзВременногоХранилищаНаСервере(Адрес)
	ТаблицаЗначенийОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	Для каждого Стр Из ТаблицаЗначенийОтпускаСотрудников Цикл  
		
		Точка = ВКМ_Диаграмма.УстановитьТочку(Стр.ВКМ_Сотрудник);
		Серия = ВКМ_Диаграмма.УстановитьСерию("Отпуск");    // 
		
		        Серия.Цвет = WEBЦвета.Бирюзовый;
			Серия.Текст = "Отпуск";
			
		Значение = ВКМ_Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ВКМ_ДатаНачало;
		Интервал.Конец = Стр.ВКМ_ДатаОкончания;
 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти
